31-Next Permutation.org
#+SETUPFILE: setup.org
#+TITLE: 31.Next-Permutation

Implement next permutation, which rearranges numbers into the lexicographically 

next greater permutation of numbers.

If such arrangement is not possible, it must rearrange it as the lowest possible order 

(ie, sorted in ascending order).

The replacement must be in-place and use only constant extra memory.

Here are some examples. Inputs are in the left-hand column and its corresponding outputs 

are in the right-hand column.

#+BEGIN_EXAMPLE
1,2,3 → 1,3,2
3,2,1 → 1,2,3
1,1,5 → 1,5,

#+END_EXAMPLE


* 题意分析

  给出一个数列，全排列中，求下一个较大序列

  52316-> 523 +61+ -> 52613 ->52 +631+ -> 53126


  推演几次增大序列后，观察出方法:

  如 52 +631+ -> 53612

  1. 从右往左找到非递增数列(631),index定位到6,在非递增数列（631）中找出比非递增数列前一位(2)大一点点的数，

    与之替换位置(53621)

  2. 把新的非递增数列(621)反转得53126

  3. 限制条件: in-place 就地替换 且 使用恒定的内存


* java

#+BEGIN_SRC java
class Solution {
    public void nextPermutation(int[] nums) {
        int index = nums.length - 1;
        boolean change = false;
        //判断是否是最大序列
        while (index > 0 && !change) {
            if (nums[index] > nums[index - 1]) {
                change = true;
                break;
            }
            index--;
        }
        if (change) {
            int bigger_index = findBigger(nums, index);
            swap(nums, index-1, bigger_index);
        }
        reverseArray(nums, index, nums.length - 1);
    }

    private void reverseArray(int[] nums, int start, int end) {
        while(start < end) {
            swap(nums,start, end);
            start++;
            end--;
        }
    }

    private void swap(int[] nums, int start, int end) {
        int t = nums[start];
        nums[start] = nums[end];
        nums[end] = t;
    }

    private int findBigger(int[] nums, int index) {
        int t = nums[index-1];
        while (index < nums.length-1) {
            if (t >= nums[index+1]) {

                return index;
            }
            index++;
        }
        return index;
    }
}

#+END_SRC
