algorithms/31-Next Permutation.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-24 Thu 21:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>31.Next-Permutation</title>
<meta name="generator" content="Org mode">
<meta name="author" content="manue1">
<link rel="stylesheet" type="text/css" href="css/worg.css" />
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.com">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">31.Next-Permutation</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaf61bb4">1. 题意分析</a></li>
<li><a href="#orgc02739a">2. java</a></li>
</ul>
</div>
</div>
<p>
Implement next permutation, which rearranges numbers into the lexicographically<br>
</p>

<p>
next greater permutation of numbers.<br>
</p>

<p>
If such arrangement is not possible, it must rearrange it as the lowest possible order<br>
</p>

<p>
(ie, sorted in ascending order).<br>
</p>

<p>
The replacement must be in-place and use only constant extra memory.<br>
</p>

<p>
Here are some examples. Inputs are in the left-hand column and its corresponding outputs<br>
</p>

<p>
are in the right-hand column.<br>
</p>

<pre class="example">
1,2,3 → 1,3,2
3,2,1 → 1,2,3
1,1,5 → 1,5,

</pre>


<div id="outline-container-orgaf61bb4" class="outline-2">
<h2 id="orgaf61bb4"><span class="section-number-2">1</span> 题意分析</h2>
<div class="outline-text-2" id="text-1">
<p>
给出一个数列，全排列中，求下一个较大序列<br>
</p>

<p>
52316-&gt; 523 <del>61</del> -&gt; 52613 -&gt;52 <del>631</del> -&gt; 53126<br>
</p>


<p>
推演几次增大序列后，观察出方法:<br>
</p>

<p>
如 52 <del>631</del> -&gt; 53612<br>
</p>

<ol class="org-ol">
<li><p>
从右往左找到非递增数列(631),index定位到6,在非递增数列（631）中找出比非递增数列前一位(2)大一点点的数，<br>
</p>

<p>
与之替换位置(53621)<br>
</p></li>

<li>把新的非递增数列(621)反转得53126<br></li>

<li>限制条件: in-place 就地替换 且 使用恒定的内存<br></li>
</ol>
</div>
</div>


<div id="outline-container-orgc02739a" class="outline-2">
<h2 id="orgc02739a"><span class="section-number-2">2</span> java</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #9d0006;">class</span> <span style="color: #8f3f71;">Solution</span> {
    <span style="color: #9d0006;">public</span> <span style="color: #8f3f71;">void</span> <span style="color: #b57614;">nextPermutation</span>(<span style="color: #8f3f71;">int</span>[] <span style="color: #076678;">nums</span>) {
        <span style="color: #8f3f71;">int</span> <span style="color: #076678;">index</span> = nums.length - 1;
        <span style="color: #8f3f71;">boolean</span> <span style="color: #076678;">change</span> = <span style="color: #8f3f71;">false</span>;
        <span style="color: #a89984;">//</span><span style="color: #a89984;">&#21028;&#26029;&#26159;&#21542;&#26159;&#26368;&#22823;&#24207;&#21015;</span>
        <span style="color: #9d0006;">while</span> (index &gt; 0 &amp;&amp; !change) {
            <span style="color: #9d0006;">if</span> (nums[index] &gt; nums[index - 1]) {
                change = <span style="color: #8f3f71;">true</span>;
                <span style="color: #9d0006;">break</span>;
            }
            index--;
        }
        <span style="color: #9d0006;">if</span> (change) {
            <span style="color: #8f3f71;">int</span> <span style="color: #076678;">bigger_index</span> = findBigger(nums, index);
            swap(nums, index-1, bigger_index);
        }
        reverseArray(nums, index, nums.length - 1);
    }

    <span style="color: #9d0006;">private</span> <span style="color: #8f3f71;">void</span> <span style="color: #b57614;">reverseArray</span>(<span style="color: #8f3f71;">int</span>[] <span style="color: #076678;">nums</span>, <span style="color: #8f3f71;">int</span> <span style="color: #076678;">start</span>, <span style="color: #8f3f71;">int</span> <span style="color: #076678;">end</span>) {
        <span style="color: #9d0006;">while</span>(start &lt; <span style="color: #8f3f71;">end</span>) {
            swap(nums,start, end);
            start++;
            end--;
        }
    }

    <span style="color: #9d0006;">private</span> <span style="color: #8f3f71;">void</span> <span style="color: #b57614;">swap</span>(<span style="color: #8f3f71;">int</span>[] <span style="color: #076678;">nums</span>, <span style="color: #8f3f71;">int</span> <span style="color: #076678;">start</span>, <span style="color: #8f3f71;">int</span> <span style="color: #076678;">end</span>) {
        <span style="color: #8f3f71;">int</span> <span style="color: #076678;">t</span> = nums[start];
        nums[start] = nums[end];
        nums[end] = t;
    }

    <span style="color: #9d0006;">private</span> <span style="color: #8f3f71;">int</span> <span style="color: #b57614;">findBigger</span>(<span style="color: #8f3f71;">int</span>[] <span style="color: #076678;">nums</span>, <span style="color: #8f3f71;">int</span> <span style="color: #076678;">index</span>) {
        <span style="color: #8f3f71;">int</span> <span style="color: #076678;">t</span> = nums[index-1];
        <span style="color: #9d0006;">while</span> (index &lt; nums.<span style="color: #8f3f71;">length</span>-1) {
            <span style="color: #9d0006;">if</span> (t &gt;= nums[index+1]) {

                <span style="color: #9d0006;">return</span> index;
            }
            index++;
        }
        <span style="color: #9d0006;">return</span> index;
    }
}

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
<script src="http://www.langdebuqing.com/css/main.js"></script>
</div>
</body>
</html>